"""


음절 끝소리 규칙(자음군 단순화) 이후에 적용해야할 음운변동

비음화 :

'ㄱ, ㄷ, ㅂ'이 'ㄴ, ㅁ' 앞에서 각각 동일한 조음 위치의 비음인 'ㅇ, ㄴ, ㅁ'으로 바뀌는 현상(역행 비음화)
예) 막는[망는], 받는다[반는다], 잡는다[잠는다]

    --> 몫만-> 목만 -> [몽만]
    --> 자음군 단순화 해야됨 

구개음화 :

① 받침이 《ㄷ, ㅌ》인 형태소 뒤에 모음 《ㅣ》나 반모음 《ㅣ[j]》로 시작되는 형식 형태소가 오면, 《ㅈ, ㅊ》이 되는 현상

② 받침이 《ㄷ》인 형태소 뒤에 형식 형태소 《히》가 오면,《ㅎ》과 결합하여 이루어진 《ㅌ》이 《ㅊ》이 되는 현상




안해도 되는 음운변동

'ㄹ'이 'ㅇ, ㅁ' 뒤에서 'ㄴ'으로 바뀌는 현상(순행 비음화)
예) 종로[종노], 남루[남누]jjjjjjjjjjjjjjjjj

    --> 정류장 -> 정뉴장
    --> ㅇ계와 ㅁ계는 ㅇㅁ 밖에 없어서 자음군 단순화가 필요없음 그리고 라임구조에 상관없음
    --> 자음군 단순화 X

유음화 : X



# 너무 복잡해서 간소화 해야할듯

ㄱ계 : ㄱㄲㅋㄳㄺ
ㄴ계 : ㄴㄵ
ㄷ계 : ㄷㅌㅅㅆㅈㅊㅎ
ㄹ계 : ㄹㄾㄻ
ㅁ계 : ㅁ   
ㅂ계 : ㅂㅍㅄㄿ
ㅇ계 : ㅇ

ㄽ받침단어는 거의없다고한다 그래서 제외


"""