
dic = {
    'p0' : 'ㅂ', 'ph' : 'ㅍ', 'pp' : 'ㅃ', 't0' : 'ㄷ', 'th' : 'ㅌ', 'tt' : 'ㄸ', 'k0' : 'ㄱ',
    'kh' : 'ㅋ', 'kk' : 'ㄲ', 's0' : 'ㅅ', 'ss' : 'ㅆ', 'h0' : 'ㅎ', 'c0' : 'ㅈ', 'ch' : 'ㅊ',
    'cc' : 'ㅉ', 'mm' : 'ㅁ', 'nn' : 'ㄴ', 'rr' : 'ㄹ', 'pf' : 'ㅂ', 'ph' : 'ㅍ', 'tf' : 'ㄷ',
    'th' : 'ㅌ', 'kf' : 'ㄱ', 'kh' : 'ㅋ', 'kk' : 'ㄲ', 's0' : 'ㅅ', 'ss' : 'ㅆ', 'h0' : 'ㅎ',
    'c0' : 'ㅈ', 'ch' : 'ㅊ', 'mf' : 'ㅁ', 'nf' : 'ㄴ', 'ng' : 'ㅇ', 'll' : 'ㄹ', 'ks' : 'ㄳ',
    'nc' : 'ㄵ', 'nh' : 'ㄶ', 'lk' : 'ㄺ', 'lm' : 'ㄻ', 'lb' : 'ㄼ', 'ls' : 'ㄽ', 'lt' : 'ㄾ',
    'lp' : 'ㄿ', 'lh' : 'ㅀ', 'ps' : 'ㅄ', 'ii' : 'ㅣ', 'ee' : 'ㅔ', 'qq' : 'ㅐ', 'aa' : 'ㅏ',
    'xx' : 'ㅡ', 'vv' : 'ㅓ', 'uu' : 'ㅜ', 'oo' : 'ㅗ', 'ye' : 'ㅖ', 'yq' : 'ㅒ', 'ya' : 'ㅑ',
    'yv' : 'ㅕ', 'yu' : 'ㅠ', 'yo' : 'ㅛ', 'wi' : 'ㅟ', 'wo' : 'ㅚ', 'wq' : 'ㅙ', 'we' : 'ㅞ',
    'wa' : 'ㅘ', 'wv' : 'ㅝ', 'xi' : 'ㅢ'
}


# 좀 덜 보수적인 자음 라임 타입
jaumtype = { 
    'ㄱ' : 'ja1', 'ㄷ' : 'ja1', 'ㅂ' : 'ja1', 'ㅈ' : 'ja1',
    'ㅌ' : 'ja2', 'ㅍ' : 'ja2', 'ㄸ' : 'ja2', 'ㅃ' : 'ja2', 'ㅋ' : 'ja2', 'ㄲ' : 'ja2', 'ㅊ' : 'ja2',
    'ㅅ' : 'ja3', 'ㅆ' : 'ja3', 'ㅉ' : 'ja3',
    'ㄴ' : 'ja4', 'ㄹ' : 'ja4', 'ㅁ' : 'ja4', 'ㅇ' : 'ja4', 'ㅎ' : 'ja4',
    '' : 'error'
}

moumtype = {
    'ㅏ' : 'mo1', 'ㅑ' : 'mo1', 'ㅘ' : 'mo1',
    'ㅓ' : 'mo2', 'ㅕ' : 'mo2', 'ㅝ' : 'mo2', 'ㅗ' : 'mo2', 'ㅛ' : 'mo2',
    'ㅜ' : 'mo3', 'ㅠ' : 'mo3', 'ㅡ' : 'mo3',
    'ㅣ' : 'mo4', 'ㅟ' : 'mo4', 'ㅢ' : 'mo4',
    'ㅐ' : 'mo5', 'ㅒ' : 'mo5', 'ㅔ' : 'mo5', 'ㅖ' : 'mo5', 'ㅙ' : 'mo5', 'ㅚ' : 'mo5', 'ㅞ' : 'mo5',
    '' : 'error'
}

moumtype_rev = {
    'mo1' : ['ㅏ', 'ㅑ', 'ㅘ'],
    'mo2' : ['ㅓ', 'ㅕ', 'ㅝ','ㅗ', 'ㅛ'],
    'mo3' : ['ㅜ', 'ㅠ', 'ㅡ'],
    'mo4' : ['ㅣ', 'ㅟ', 'ㅢ'],
    'mo5' : ['ㅐ', 'ㅒ', 'ㅔ', 'ㅖ', 'ㅙ', 'ㅚ', 'ㅞ']
}
